Thanks for the feedback. The base64 encoding was part of the problem and it wasn't entirely obvious until I looked at the generated user data for the launch template. 

The other part that threw me off initially was the fact that when I added user data, the plan output was saying that the autoscaling group was being deleted and was not being replaced. I suppose this is an artifact of Terraform itself more than anything, so I'm not sure how to make this go away. 

For example, by adding only `pre_bootstrap_user_data` this is what the plan output looked like:

```text
  ...some parts unrelated parts omitted for simplicity... 
  
  # module.customer_eks.module.eks.module.eks_managed_node_group["query_nodes"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
     ...
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-query_nodes-20240827150752215800000001-2ec8ca30-8375-1070-cdf1-4b8558db3083"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)

      ~ launch_template {
            id      = "lt-01ffe24699b0d35a6"
          ~ name    = "query_nodes-20240827013628714900000030" -> (known after apply)
          ~ version = "1" -> (known after apply)
        }
    }

  # module.customer_eks.module.eks.module.eks_managed_node_group["query_nodes"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-01ffe24699b0d35a6"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "query_nodes-20240827013628714900000030"
        tags                    = {}
      + user_data               = "<base64 user data>"
        # (9 unchanged attributes hidden)
        ...
        # (6 unchanged blocks hidden)
    }
```